Tekla.Structures.TeklaStructuresInternal.TeklaStructuresApplication
Provides access to TS functionality tied to the process.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresApplication.AuthenticationAsyncCallback
Sets the authentication callback.